HarryVienna/ESP32-Weather-Station-and-Air-Quality-Monitor/Sensor-LORA-BME280/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# No reboot after panic
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# 80 MHz is sufficient for I2C/SPI/ADC — saves ~40 mA vs 240 MHz during active phase
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=80

# Flash size (detected 8 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8mb"

# ADC Calibration: ESP32-S3 uses curve fitting
CONFIG_ADC_CALI_CURVE_FITTING_ENABLE=y

# Skip firmware SHA256 validation on deep-sleep wake — saves ~200 ms at ~100 mA
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y

# Logging — uncomment for production to save active time and binary size
#CONFIG_LOG_DEFAULT_LEVEL_NONE=y
#CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
